
[
    "I'll be using this app from now on. Y'all are literally the best thing I have found for doing my wedding planning business! -- MaryLou R.",

    "Works like a charm. I love the ease of the app and would highly recommend purchasing their monthly program. -- John D.",

    "I didn't even know where to start as far as creating great balloon ornamentation for birthdays, weddings, showers, etc. This is really the 'go-to' place for all your balloon needs. -- Deb H.",

    "I'm very passionate about my balloons. The Balloonatic Asylum has the best range of products and prices anywhere. -- Ivan G.",

    "The staff and support are second to none. They are polished, proficient, accessible and patient. -- Hamish M.",

    "The customer service folks are very approachable and available to answer any questions, at any time. -- Joe Z.",

    "The 'Build a Balloon Bouquet' feature is terrific. So many choices and the expert guidance is SO helpful. -- Hamid F.",

    "I'd rate them an 11 on a scale of 1 to 10. -- Jan B., Brooklyn, NY",

    "I started at stage zero. With their help at the 'Asylum' I was able to start a new balloon-based business literally out of thin--helium-filled--air! :-) -- Tony S.",

    "Stellar customer service! -- Fred F., Miami, FL",

    "The Balloonatic Asylum team represents the highest levels of customer service I have experienced. Information was accurate, responses to queries were turned around very fast. Answers were clear and where necessary detailed enough for us to make informed decisions quickly, minimising the end to end time to process complex transactions among a number of parties. -- Saloni P., West Haven, CT",

    "A fantastic organisation! Great cutomer support from beginning to end of the process. The team are really informed and go the extra mile at every stage. I would recommend them unreservedly. -- Riddhi J., West Haven, CT",

    "I chatted with John Jacobs. He was very helpful and answered all my questions concerning my order. I believe he had my interest at heart and found the best products for me at a good price. -- Ed W., CT",

    "Excellent customer service. My rep was very friendly, patient and helpful in helping us find what we were looking for. -- Ted M., Darien, CT"
    
]
